In [1]:
a =10

In [2]:
a

10

In [1]:
high_schools = ["Hernandez High School", "Figueroa High School",
                "Wilson High School","Wright High School"]

In [2]:
high_schools

['Hernandez High School',
 'Figueroa High School',
 'Wilson High School',
 'Wright High School']

In [3]:
for school in high_schools:
    print(school)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [1]:
for school in high_schools:
    print(school)

NameError: name 'high_schools' is not defined

In [2]:
high_schools = ["Hernandez High School", "Figueroa High School",
                "Wilson High School","Wright High School"]

In [3]:
high_Schools

NameError: name 'high_Schools' is not defined

In [4]:
print(high_schools)

['Hernandez High School', 'Figueroa High School', 'Wilson High School', 'Wright High School']

In [5]:
for school in high_schools:
    print(school)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [6]:
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]

In [7]:
high_school_types

[{'High School': 'Griffin', 'Type': 'District'},
 {'High School': 'Figueroa', 'Type': 'District'},
 {'High School': 'Wilson', 'Type': 'Charter'},
 {'High School': 'Wright', 'Type': 'Charter'}]

In [8]:
for high_school in high_school_types:
    print(high_school)

{'High School': 'Griffin', 'Type': 'District'}
{'High School': 'Figueroa', 'Type': 'District'}
{'High School': 'Wilson', 'Type': 'Charter'}
{'High School': 'Wright', 'Type': 'Charter'}

In [9]:
print(high_school[High School])

SyntaxError: invalid syntax (<ipython-input-9-40246815c63e>, line 1)

In [10]:
print(high_school['High School'])

Wright

In [11]:
print(high_school['High School'])

Wright

In [12]:
import pandas as pd
high_schools = ["Huang High School",  "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [13]:
high_schools

['Huang High School',
 'Figueroa High School',
 'Shelton High School',
 'Hernandez High School',
 'Griffin High School',
 'Wilson High School',
 'Cabrera High School',
 'Bailey High School',
 'Holden High School',
 'Pena High School',
 'Wright High School',
 'Rodriguez High School',
 'Johnson High School',
 'Ford High School',
 'Thomas High School']

In [14]:
school_series = pd.Series(high_schools)

In [15]:
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [16]:
pandas.DataFrame()

NameError: name 'pandas' is not defined

In [17]:
high_school_dicts = [{"School ID": 0, "school_name": "Huang High    School", "type": "District"},
                   {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [18]:
school_df = pd.DataFrame(high_school_dicts)

In [19]:
school_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [20]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [21]:
schools_df = pd.DataFrame()

In [22]:
schools_df["School ID"] = school_id

In [23]:

schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [24]:
high_school_dicts = [{"School ID": 0, "school_name": "Huang High    School", "type": "District"},
                   {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [25]:
school_df = pd.DataFrame(high_school_dicts)

In [26]:
school_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [27]:
school_id = [0, 1, 2, 3, 4]
school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]
type_of_school = ["District", "District", "Charter", "District","Charter"]

In [28]:
schools_df = pd.DataFrame()

In [29]:
schools_df["School ID"] = school_id

In [30]:

schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [31]:
schools_df["school_name"] = school_name

In [32]:
schools_df

   School ID            school_name
0          0      Huang High School
1          1   Figueroa High School
2          2    Shelton High School
3          3  Hernandez High School
4          4    Griffin High School

In [33]:
schools_df["type_of_school"] = type

In [34]:
schools_df

   School ID            school_name  type_of_school
0          0      Huang High School  <class 'type'>
1          1   Figueroa High School  <class 'type'>
2          2    Shelton High School  <class 'type'>
3          3  Hernandez High School  <class 'type'>
4          4    Griffin High School  <class 'type'>

In [35]:
schools_df["type"] = type_of_school

In [36]:
schools_df

   School ID            school_name  type_of_school      type
0          0      Huang High School  <class 'type'>  District
1          1   Figueroa High School  <class 'type'>  District
2          2    Shelton High School  <class 'type'>   Charter
3          3  Hernandez High School  <class 'type'>  District
4          4    Griffin High School  <class 'type'>   Charter

In [37]:
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

In [38]:
 high_schools_dict = df.high_schools_dict()

NameError: name 'df' is not defined

In [39]:
 high_schools_dict = pd.DataFrame()

In [40]:
high_schools_dict

Empty DataFrame
Columns: []
Index: []

In [41]:
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

In [42]:
high_schools_dict = pd.DataFrame(high_schools_dict)

In [43]:
high_schools_dict

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [44]:
school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [45]:
school_df.index

RangeIndex(start=0, stop=5, step=1)

In [46]:
school_df.values

array([[0, 'Huang High    School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [47]:
import pandas as pd

In [48]:
a = 10

In [49]:
a

10

In [1]:
# List of high schools
high_schools = ["Hernandez High School", "Figueroa High School",
                "Wilson High School","Wright High School"]

In [2]:
high_schools

['Hernandez High School',
 'Figueroa High School',
 'Wilson High School',
 'Wright High School']

In [3]:
for school in high_schools:
    print(high_schools)

['Hernandez High School', 'Figueroa High School', 'Wilson High School', 'Wright High School']
['Hernandez High School', 'Figueroa High School', 'Wilson High School', 'Wright High School']
['Hernandez High School', 'Figueroa High School', 'Wilson High School', 'Wright High School']
['Hernandez High School', 'Figueroa High School', 'Wilson High School', 'Wright High School']

In [4]:
for school in high_schools:
    print(school)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [5]:
school_series = pd.Series(high_schools)

NameError: name 'pd' is not defined

In [6]:
import pandas as pd
school_series = pd.Series(high_schools)

In [7]:
school_series

0    Hernandez High School
1     Figueroa High School
2       Wilson High School
3       Wright High School
dtype: object

In [8]:
high_school_dicts = [{"School ID": 0, "school_name": "Huang High    School", "type": "District"},
                   {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [9]:
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [10]:
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [11]:
schools_df = pd.DataFrame()

In [12]:
schools_df["School ID"] = school_id

In [13]:
schools_df["school_name"] = school_name
schools_df["type_of_school"] = type

In [14]:
school

'Wright High School'

In [15]:
schools_df

   School ID            school_name  type_of_school
0          0      Huang High School  <class 'type'>
1          1   Figueroa High School  <class 'type'>
2          2    Shelton High School  <class 'type'>
3          3  Hernandez High School  <class 'type'>
4          4    Griffin High School  <class 'type'>

In [16]:
schools_df = pd.DataFrame()

In [17]:
schools_df["School ID"] = school_id
schools_df["school_name"] = school_name
schools_df["type_of_school"] = type

In [18]:
schools_df

   School ID            school_name  type_of_school
0          0      Huang High School  <class 'type'>
1          1   Figueroa High School  <class 'type'>
2          2    Shelton High School  <class 'type'>
3          3  Hernandez High School  <class 'type'>
4          4    Griffin High School  <class 'type'>

In [19]:
schools_df["School ID"] = school_id
schools_df["school_name"] = school_name
schools_df["type_of_school"] = "Type"

In [20]:
schools_df

   School ID            school_name type_of_school
0          0      Huang High School           Type
1          1   Figueroa High School           Type
2          2    Shelton High School           Type
3          3  Hernandez High School           Type
4          4    Griffin High School           Type

In [21]:
type_of_school

['District', 'District', 'Charter', 'District', 'Charter']

In [22]:
high_school_dicts = [{"School ID": 0, "school_name": "Huang High    School", "type": "District"},
                   {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [23]:
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [24]:
school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [25]:
school_df.index

RangeIndex(start=0, stop=5, step=1)

In [26]:
school_df.values

array([[0, 'Huang High    School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)